Ran Plan for 4 projects:

1. project: `k8s-dev` dir: `k8s` workspace: `filecoin-dev-apn1-glif-eks`
1. project: `aws-dev` dir: `aws` workspace: `filecoin-glif-dev-apn1`
1. project: `k8s` dir: `k8s` workspace: `filecoin-mainnet-apn1-glif-eks`
1. project: `aws` dir: `aws` workspace: `filecoin-glif-mainnet-apn1`

### 1. project: `k8s-dev` dir: `k8s` workspace: `filecoin-dev-apn1-glif-eks`
<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/tls from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Using previously-installed hashicorp/aws v4.33.0
- Using previously-installed hashicorp/random v3.4.3
- Using previously-installed hashicorp/kubernetes v2.13.1
- Using previously-installed hashicorp/helm v2.6.0
- Using previously-installed hashicorp/tls v4.0.2
- Using previously-installed hashicorp/local v2.2.3

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "filecoin-dev-apn1-glif-eks".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lb.kong_external will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lb" "kong_external" {
      + access_logs                = (known after apply)
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + customer_owned_ipv4_pool   = (known after apply)
      + desync_mitigation_mode     = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = (known after apply)
      + enable_deletion_protection = (known after apply)
      + enable_http2               = (known after apply)
      + enable_waf_fail_open       = (known after apply)
      + id                         = (known after apply)
      + idle_timeout               = (known after apply)
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = (known after apply)
      + name                       = (known after apply)
      + preserve_host_header       = (known after apply)
      + security_groups            = (known after apply)
      + subnet_mapping             = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "filecoin-dev-apn1-glif-kong-external"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # aws_route53_record.atlantis[0] will be updated in-place
~ resource "aws_route53_record" "atlantis" {
        id              = "Z09410602UCRWJDOQ7CH7_atlantis.dev.node.glif.io_CNAME"
        name            = "atlantis.dev.node.glif.io"
      ~ records         = [
          - "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.monitoring[0] will be updated in-place
~ resource "aws_route53_record" "monitoring" {
        id              = "Z09410602UCRWJDOQ7CH7_monitoring.dev.node.glif.io_CNAME"
        name            = "monitoring.dev.node.glif.io"
      ~ records         = [
          - "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.nlb_ingress_external_api_test[0] will be destroyed
  # (because aws_route53_record.nlb_ingress_external_api_test is not in configuration)
- resource "aws_route53_record" "nlb_ingress_external_api_test" {
      - allow_overwrite = true -> null
      - fqdn            = "wss.dev.node.glif.io" -> null
      - id              = "Z09410602UCRWJDOQ7CH7_wss.dev.node.glif.io_CNAME" -> null
      - name            = "wss.dev.node.glif.io" -> null
      - records         = [
          - "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z09410602UCRWJDOQ7CH7" -> null
    }

  # aws_route53_record.wss_dev_node_glif_io[0] will be destroyed
  # (because aws_route53_record.wss_dev_node_glif_io is not in configuration)
- resource "aws_route53_record" "wss_dev_node_glif_io" {
      - allow_overwrite = true -> null
      - fqdn            = "test.dev.node.glif.io" -> null
      - id              = "Z09410602UCRWJDOQ7CH7_test.dev.node.glif.io_CNAME" -> null
      - name            = "test.dev.node.glif.io" -> null
      - records         = [
          - "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z09410602UCRWJDOQ7CH7" -> null
    }

  # helm_release.atlantis_main will be updated in-place
~ resource "helm_release" "atlantis_main" {
        id                         = "atlantis"
        name                       = "atlantis"
      ~ values                     = [
          - (sensitive),
          + (sensitive),
        ]
        # (27 unchanged attributes hidden)
    }

  # helm_release.konghq-external will be updated in-place
~ resource "helm_release" "konghq-external" {
        id                         = "filecoin-dev-apn1-glif-kong-external"
        name                       = "filecoin-dev-apn1-glif-kong-external"
      ~ version                    = "2.13.0" -> "2.12.0"
        # (27 unchanged attributes hidden)

      - set {
          - name  = "ingressController.image.tag" -> null
          - value = "2.8" -> null
        }
      - set {
          - name  = "ingressController.ingressClass" -> null
          - value = "kong-external-lb" -> null
        }
      + set {
          + name  = "ingressController.ingressClass"
          + value = "kong-external-lb"
        }
      - set {
          - name  = "ingressController.ingressClassAnnotations.ingressclass\\.kubernetes\\.io/is-default-class" -> null
          - value = "true" -> null
        }
      + set {
          + name  = "ingressController.ingressClassAnnotations.ingressclass\\.kubernetes\\.io/is-default-class"
          + value = "true"
        }
      - set {
          - name  = "ingressController.installCRDs" -> null
          - value = "false" -> null
        }
      + set {
          + name  = "ingressController.installCRDs"
          + value = "false"
        }
      - set {
          - name  = "proxy.annotations.prometheus\\.io/port" -> null
          - value = "10254" -> null
        }
      + set {
          + name  = "proxy.annotations.prometheus\\.io/port"
          + value = "10254"
        }
      - set {
          - name  = "proxy.annotations.prometheus\\.io/scrape" -> null
          - value = "true" -> null
        }
      + set {
          + name  = "proxy.annotations.prometheus\\.io/scrape"
          + value = "true"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-additional-resource-tags" -> null
          - value = "Name=filecoin-dev-apn1-glif-kong-external" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-additional-resource-tags"
          + value = "Name=filecoin-dev-apn1-glif-kong-external"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-backend-protocol" -> null
          - value = "https" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-backend-protocol"
          + value = "https"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-proxy-protocol" -> null
          - value = "*" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-proxy-protocol"
          + value = "*"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-cert" -> null
          - value = "arn:aws:acm:ap-northeast-1:499623857295:certificate/a875c715-7e6a-4ff2-91e3-6d0271e755c0" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-cert"
          + value = "arn:aws:acm:ap-northeast-1:499623857295:certificate/a875c715-7e6a-4ff2-91e3-6d0271e755c0"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-negotiation-policy" -> null
          - value = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-negotiation-policy"
          + value = "ELBSecurityPolicy-TLS13-1-2-2021-06"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-ports" -> null
          - value = "443" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-ports"
          + value = "443"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type" -> null
          - value = "nlb" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type"
          + value = "nlb"
        }
      - set {
          - name  = "proxy.stream[0].containerPort" -> null
          - value = "1235" -> null
        }
      + set {
          + name  = "proxy.stream[0].containerPort"
          + value = "1235"
        }
      - set {
          - name  = "proxy.stream[0].protocol" -> null
          - value = "TCP" -> null
        }
      + set {
          + name  = "proxy.stream[0].protocol"
          + value = "TCP"
        }
      - set {
          - name  = "proxy.stream[0].servicePort" -> null
          - value = "1235" -> null
        }
      + set {
          + name  = "proxy.stream[0].servicePort"
          + value = "1235"
        }
      - set {
          - name  = "proxy.tls.overrideServiceTargetPort" -> null
          - value = "8000" -> null
        }
      + set {
          + name  = "proxy.tls.overrideServiceTargetPort"
          + value = "8000"
        }
      - set {
          - name  = "replicaCount" -> null
          - value = "2" -> null
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_circulating_supply will be destroyed
  # (because kubernetes_ingress_v1.get_circulating_supply is not in configuration)
- resource "kubernetes_ingress_v1" "get_circulating_supply" {
      - id     = "network/kong-apigw-dev-get-circulating-supply" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"   = "GET"
              - "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-to-rpcv0, kong-apigw-dev-serverless-function-statecirculatingsupply"
              - "konghq.com/protocols" = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-circulating-supply" -> null
          - namespace        = "network" -> null
          - resource_version = "74718545" -> null
          - uid              = "6d1eb404-b313-4e94-952d-90e7ec3cc6b0" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/statecirculatingsupply" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "api-read-dev-lotus-service" -> null

                              - port {
                                  - number = 1234 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_circulating_supply_fil will be destroyed
  # (because kubernetes_ingress_v1.get_circulating_supply_fil is not in configuration)
- resource "kubernetes_ingress_v1" "get_circulating_supply_fil" {
      - id     = "network/kong-apigw-dev-get-circulating-supply-fil" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"       = "GET"
              - "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-index"
              - "konghq.com/preserve-host" = "false"
              - "konghq.com/protocols"     = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-circulating-supply-fil" -> null
          - namespace        = "network" -> null
          - resource_version = "74718529" -> null
          - uid              = "3736b83c-32b6-465b-ac82-8b45e7f79826" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/statecirculatingsupply/fil" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "kong-apigw-dev-circulatingsupply" -> null

                              - port {
                                  - number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_circulating_supply_fil_v2 will be destroyed
  # (because kubernetes_ingress_v1.get_circulating_supply_fil_v2 is not in configuration)
- resource "kubernetes_ingress_v1" "get_circulating_supply_fil_v2" {
      - id     = "network/kong-apigw-dev-get-circulating-supply-fil-v2" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"       = "GET"
              - "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-index"
              - "konghq.com/preserve-host" = "false"
              - "konghq.com/protocols"     = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-circulating-supply-fil-v2" -> null
          - namespace        = "network" -> null
          - resource_version = "74718530" -> null
          - uid              = "d538aee5-b1f5-42c9-aa63-8765f976456b" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/statecirculatingsupply/fil/v2" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "kong-apigw-dev-circulatingsupply-staging" -> null

                              - port {
                                  - number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_diluted_supply will be destroyed
  # (because kubernetes_ingress_v1.get_diluted_supply is not in configuration)
- resource "kubernetes_ingress_v1" "get_diluted_supply" {
      - id     = "network/kong-apigw-dev-get-dilutedsupply" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"       = "GET"
              - "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-dilutedsupply"
              - "konghq.com/preserve-host" = "false"
              - "konghq.com/protocols"     = "http"
            } -> null
          - generation       = 2 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-dilutedsupply" -> null
          - namespace        = "network" -> null
          - resource_version = "74723233" -> null
          - uid              = "d3c8663b-ed7d-429d-955f-75f11000c5d8" -> null
        }

      - spec {

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/dilutedsupply" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "kong-apigw-dev-circulatingsupply" -> null

                              - port {
                                  - number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_root will be destroyed
  # (because kubernetes_ingress_v1.get_root is not in configuration)
- resource "kubernetes_ingress_v1" "get_root" {
      - id     = "network/kong-apigw-dev-get-root" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"       = "GET"
              - "konghq.com/preserve-host" = "false"
              - "konghq.com/protocols"     = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-root" -> null
          - namespace        = "network" -> null
          - resource_version = "74718501" -> null
          - uid              = "d72e3d41-50b5-4f02-ab1b-b8c9c6422611" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/" -> null
                      - path_type = "Prefix" -> null

                      - backend {

                          - service {
                              - name = "kong-apigw-dev-homepage" -> null

                              - port {
                                  - number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_rpc_v0 will be destroyed
  # (because kubernetes_ingress_v1.get_rpc_v0 is not in configuration)
- resource "kubernetes_ingress_v1" "get_rpc_v0" {
      - id     = "network/kong-apigw-dev-get-rpc-v0" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"   = "GET"
              - "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-to-root"
              - "konghq.com/protocols" = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-rpc-v0" -> null
          - namespace        = "network" -> null
          - resource_version = "74718503" -> null
          - uid              = "dc73b5a0-d419-4a2c-87a4-b6f2c5e5a301" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/rpc/v0" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "kong-apigw-dev-homepage" -> null

                              - port {
                                  - number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_rpc_v1 will be destroyed
  # (because kubernetes_ingress_v1.get_rpc_v1 is not in configuration)
- resource "kubernetes_ingress_v1" "get_rpc_v1" {
      - id     = "network/kong-apigw-dev-get-rpc-v1" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"   = "GET"
              - "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-to-root"
              - "konghq.com/protocols" = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-rpc-v1" -> null
          - namespace        = "network" -> null
          - resource_version = "74718504" -> null
          - uid              = "8b61f7c5-a340-424d-862d-18c42ffdff0c" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/rpc/v1" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "kong-apigw-dev-homepage" -> null

                              - port {
                                  - number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_vm_circulating_supply will be destroyed
  # (because kubernetes_ingress_v1.get_vm_circulating_supply is not in configuration)
- resource "kubernetes_ingress_v1" "get_vm_circulating_supply" {
      - id     = "network/kong-apigw-dev-get-vm-circulating-supply" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"   = "GET"
              - "konghq.com/plugins"   = "kong-apigw-dev-serverless-function-vmcirculatingsupply, kong-apigw-dev-request-transformer-to-rpcv0"
              - "konghq.com/protocols" = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-get-vm-circulating-supply" -> null
          - namespace        = "network" -> null
          - resource_version = "74718539" -> null
          - uid              = "1992c883-600f-4f4b-98fc-406d72ffa5c3" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/vmcirculatingsupply" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "api-read-dev-lotus-service" -> null

                              - port {
                                  - number = 1234 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.post_root will be destroyed
  # (because kubernetes_ingress_v1.post_root is not in configuration)
- resource "kubernetes_ingress_v1" "post_root" {
      - id     = "network/kong-apigw-dev-post-root" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"       = "POST"
              - "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-rpc-v0, kong-apigw-dev-request-transformer-to-rpcv0"
              - "konghq.com/preserve-host" = "false"
              - "konghq.com/protocols"     = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-post-root" -> null
          - namespace        = "network" -> null
          - resource_version = "74718546" -> null
          - uid              = "a1daf9ac-3ce6-4fe6-8d28-18eb91189f2c" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "api-read-dev-lotus-service" -> null

                              - port {
                                  - number = 2346 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.post_rpc_v0 will be destroyed
  # (because kubernetes_ingress_v1.post_rpc_v0 is not in configuration)
- resource "kubernetes_ingress_v1" "post_rpc_v0" {
      - id     = "network/kong-apigw-dev-post-rpc-v0" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"   = "POST"
              - "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-to-rpcv0"
              - "konghq.com/protocols" = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-post-rpc-v0" -> null
          - namespace        = "network" -> null
          - resource_version = "74718527" -> null
          - uid              = "b25b36ab-5621-4408-9396-95513250e41a" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/rpc/v0" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "api-read-dev-lotus-service" -> null

                              - port {
                                  - number = 2346 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.post_rpc_v1 will be destroyed
  # (because kubernetes_ingress_v1.post_rpc_v1 is not in configuration)
- resource "kubernetes_ingress_v1" "post_rpc_v1" {
      - id     = "network/kong-apigw-dev-post-rpc-v1" -> null
      - status = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - hostname = "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com"
                              - ip       = ""
                            },
                        ]
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "konghq.com/methods"   = "POST"
              - "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-to-rpcv0"
              - "konghq.com/protocols" = "http"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-post-rpc-v1" -> null
          - namespace        = "network" -> null
          - resource_version = "74718528" -> null
          - uid              = "d6e7359b-7c47-4fe2-974d-72059088ed4e" -> null
        }

      - spec {
          - ingress_class_name = "kong-external-lb" -> null

          - rule {
              - host = "wss.dev.node.glif.io" -> null

              - http {
                  - path {
                      - path      = "/rpc/v1" -> null
                      - path_type = "Exact" -> null

                      - backend {

                          - service {
                              - name = "api-read-dev-lotus-service" -> null

                              - port {
                                  - number = 2346 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-public_access will be destroyed
  # (because kubernetes_manifest.request_transformer-public_access is not in configuration)
- resource "kubernetes_manifest" "request_transformer-public_access" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - add = {
                  - headers = [
                      - (sensitive),
                    ]
                }
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-to-rpcv0"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - add = {
                  - headers = [
                      - "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.wvjvRpu07OZOFsMXWQsQhsUso0WaK9GYgBnKGRO7pUI",
                    ]
                }
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-to-rpcv0"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-statecirculatingsupply will be destroyed
  # (because kubernetes_manifest.request_transformer-statecirculatingsupply is not in configuration)
- resource "kubernetes_manifest" "request_transformer-statecirculatingsupply" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - add         = {
                  - headers = [
                      - "Content-Type:application/json",
                    ]
                }
              - http_method = "POST"
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-statecirculatingsupply"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - add         = {
                  - headers = [
                      - "Content-Type:application/json",
                    ]
                }
              - http_method = "POST"
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-statecirculatingsupply"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_diluted_supply will be destroyed
  # (because kubernetes_manifest.request_transformer-to_diluted_supply is not in configuration)
- resource "kubernetes_manifest" "request_transformer-to_diluted_supply" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - replace = {
                  - uri = "/diluted_supply.html"
                }
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-to-dilutedsupply"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - replace = {
                  - uri = "/diluted_supply.html"
                }
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-to-dilutedsupply"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_index will be destroyed
  # (because kubernetes_manifest.request_transformer-to_index is not in configuration)
- resource "kubernetes_manifest" "request_transformer-to_index" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - replace = {
                  - uri = "/index.html"
                }
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-to-index"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - replace = {
                  - uri = "/index.html"
                }
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-to-index"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_root will be destroyed
  # (because kubernetes_manifest.request_transformer-to_root is not in configuration)
- resource "kubernetes_manifest" "request_transformer-to_root" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - replace = {
                  - uri = "/"
                }
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-to-root"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - replace = {
                  - uri = "/"
                }
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-to-root"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_rpc_v0 will be destroyed
  # (because kubernetes_manifest.request_transformer-to_rpc_v0 is not in configuration)
- resource "kubernetes_manifest" "request_transformer-to_rpc_v0" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - replace = {
                  - uri = "/rpc/v0"
                }
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-to-rpc-v0"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - replace = {
                  - uri = "/rpc/v0"
                }
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-to-rpc-v0"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-vmcirculatingsupply will be destroyed
  # (because kubernetes_manifest.request_transformer-vmcirculatingsupply is not in configuration)
- resource "kubernetes_manifest" "request_transformer-vmcirculatingsupply" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - add         = {
                  - body    = [
                      - "jsonrpc:2.0",
                      - "method:Filecoin.StateVMCirculatingSupplyInternal",
                      - "id:42",
                      - "params:[[]]",
                    ]
                  - headers = [
                      - "Content-Type:application/json",
                    ]
                }
              - http_method = "POST"
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-request-transformer-vmcirculatingsupply"
              - namespace = "network"
            }
          - plugin     = "request-transformer"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - add         = {
                  - body    = [
                      - "jsonrpc:2.0",
                      - "method:Filecoin.StateVMCirculatingSupplyInternal",
                      - "id:42",
                      - "params:[[]]",
                    ]
                  - headers = [
                      - "Content-Type:application/json",
                    ]
                }
              - http_method = "POST"
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-request-transformer-vmcirculatingsupply"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "request-transformer"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.serverless_function-statecirculatingsupply will be destroyed
  # (because kubernetes_manifest.serverless_function-statecirculatingsupply is not in configuration)
- resource "kubernetes_manifest" "serverless_function-statecirculatingsupply" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - access        = [
                  - <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateCirculatingSupply","id":42,"params":[[]]}')
                    EOT,
                ]
              - body_filter   = [
                  - <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"result":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              - header_filter = [
                  - <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-serverless-function-statecirculatingsupply"
              - namespace = "network"
            }
          - plugin     = "post-function"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - access        = [
                  - <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateCirculatingSupply","id":42,"params":[[]]}')
                    EOT,
                ]
              - body_filter   = [
                  - <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"result":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              - header_filter = [
                  - <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-serverless-function-statecirculatingsupply"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "post-function"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.serverless_function-vmcirculatingsupply will be destroyed
  # (because kubernetes_manifest.serverless_function-vmcirculatingsupply is not in configuration)
- resource "kubernetes_manifest" "serverless_function-vmcirculatingsupply" {
      - manifest = {
          - apiVersion = "configuration.konghq.com/v1"
          - config     = {
              - access        = [
                  - <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateVMCirculatingSupplyInternal","id":42,"params":[[]]}')
                    EOT,
                ]
              - body_filter   = [
                  - <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"FilCirculating":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              - header_filter = [
                  - <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          - kind       = "KongPlugin"
          - metadata   = {
              - name      = "kong-apigw-dev-serverless-function-vmcirculatingsupply"
              - namespace = "network"
            }
          - plugin     = "post-function"
        } -> null
      - object   = {
          - apiVersion  = "configuration.konghq.com/v1"
          - config      = {
              - access        = [
                  - <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateVMCirculatingSupplyInternal","id":42,"params":[[]]}')
                    EOT,
                ]
              - body_filter   = [
                  - <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"FilCirculating":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              - header_filter = [
                  - <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          - configFrom  = {
              - secretKeyRef = {
                  - key  = null
                  - name = null
                }
            }
          - consumerRef = null
          - disabled    = null
          - kind        = "KongPlugin"
          - metadata    = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "kong-apigw-dev-serverless-function-vmcirculatingsupply"
              - namespace                  = "network"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - ordering    = {
              - after  = null
              - before = null
            }
          - plugin      = "post-function"
          - protocols   = null
          - run_on      = null
        } -> null
    }

  # module.api_gateway_kong_dev[0].kubernetes_service.circulating_supply will be destroyed
  # (because kubernetes_service.circulating_supply is not in configuration)
- resource "kubernetes_service" "circulating_supply" {
      - id                     = "network/kong-apigw-dev-circulatingsupply" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-circulatingsupply" -> null
          - namespace        = "network" -> null
          - resource_version = "74718385" -> null
          - uid              = "1f548c76-2714-4dc1-afdc-dc0c864fff64" -> null
        }

      - spec {
          - allocate_load_balancer_node_ports = true -> null
          - cluster_ips                       = [] -> null
          - external_ips                      = [] -> null
          - external_name                     = "circulatingsupply.s3.amazonaws.com" -> null
          - health_check_node_port            = 0 -> null
          - internal_traffic_policy           = "Cluster" -> null
          - ip_families                       = [] -> null
          - load_balancer_source_ranges       = [] -> null
          - publish_not_ready_addresses       = false -> null
          - selector                          = {} -> null
          - session_affinity                  = "None" -> null
          - type                              = "ExternalName" -> null

          - port {
              - name        = "http" -> null
              - node_port   = 0 -> null
              - port        = 80 -> null
              - protocol    = "TCP" -> null
              - target_port = "80" -> null
            }
          - port {
              - name        = "https" -> null
              - node_port   = 0 -> null
              - port        = 443 -> null
              - protocol    = "TCP" -> null
              - target_port = "443" -> null
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_service.circulating_supply_staging will be destroyed
  # (because kubernetes_service.circulating_supply_staging is not in configuration)
- resource "kubernetes_service" "circulating_supply_staging" {
      - id                     = "network/kong-apigw-dev-circulatingsupply-staging" -> null
      - status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = []
                    },
                ]
            },
        ] -> null
      - wait_for_load_balancer = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "kong-apigw-dev-circulatingsupply-staging" -> null
          - namespace        = "network" -> null
          - resource_version = "74718349" -> null
          - uid              = "bb48280b-df36-4183-9b01-cb6ff981ed82" -> null
        }

      - spec {
          - allocate_load_balancer_node_ports = true -> null
          - cluster_ips                       = [] -> null
          - external_ips                      = [] -> null
          - external_name                     = "circulatingsupply-staging.s3.amazonaws.com" -> null
          - health_check_node_port            = 0 -> null
          - internal_traffic_policy           = "Cluster" -> null
          - ip_families                       = [] -> null
          - load_balancer_source_ranges       = [] -> null
          - publish_not_ready_addresses       = false -> null
          - selector                          = {} -> null
          - session_affinity                  = "None" -> null
          - type                              = "ExternalName" -> null

          - port {
              - name        = "http" -> null
              - node_port   = 0 -> null
              - port        = 80 -> null
              - protocol    = "TCP" -> null
              - target_port = "80" -> null
            }
          - port {
              - name        = "https" -> null
              - node_port   = 0 -> null
              - port        = 443 -> null
              - protocol    = "TCP" -> null
              - target_port = "443" -> null
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_service.homepage will be destroyed
  # (because kubernetes_service.homepage is not in configuration)
- resource "kubernetes_service" "homepage" {
      - id                     = "network/kong-apigw-dev-homepage" -> null
      - s
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.